// Задача. Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.

// int Prog (int num){

//     for (int curr = 1; curr < num; curr++)
//         num = num / 10;
    
//     return curr;
// }

// Console.WriteLine("Введите число");
// int number = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine(Prog(number));



// Задача. Напишите программу, которая находит в последовательности от 1 до N все нечетные числа




// Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
//[1,0,1,1,0,1,0,0]

